import 'package:get/get.dart';

class MyTranslation extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
    "ar": {
      "1": "أنشاء حساب",
      "2": "تسجيل الدخول",
      "3": "الاسم الكامل",
      "4": "البريد ألالكتروني",
      "5": "كلمة المرور",
      "6": "رقم الهاتف",
      "7": "هل لديك حساب بالفعل؟ قم بتسجيل الدخول ",
      "8": "هل نسيت كلمة المرور؟",
      "9": "الرجاء إدخال بريدك الإلكتروني",
      "10": "أرسال",
      "11": "أدخل رمز التحقق المرسل إلى عنوان بريدك الإلكتروني",
      "12": "رمز التحقق",
      "13": "تأكيد",
      "14": "جاري التحقق...",
      "15": "إعادة إرسال الرمز",
      "16": "إعادة تعيين كلمة المرور",
      "17": "أدخل كلمة المرور الجديدة الخاصة بك",
      "18": "كلمة المرور الجديدة",
      "19": "يرجى إدخال رمز التحقق",
      "20":  "تم إرسال رمز التحقق إلى بريدك الإلكتروني",





      "21":  "يرجى إدخال اسمك",
      "22":  "يرجى إدخال بريدك الإلكتروني",
      "23":  "يرجى إدخال بريد إلكتروني صحيح",
      "24":  "يرجى إدخال كلمة المرور",
      "25":  "يرجى إدخال رقم هاتفك",
      "26":  "يجب ألا تقل كلمة المرور عن 8 أحرف",
      "27":  "عدد محاولات تسجيل الدخول كبير جدًا. يرجى المحاولة لاحقًا",
      "28":  "يجب أن يحتوي الرمز على أرقام فقط.",
      "29":  "لم يتم إدخال البريد الإلكتروني",
      "30": "عربي",
      "31": "انکليزي",
      "32": "کوردی",

      "33": "لا يوجد إنترنت",
      "34": "يرجى التحقق من اتصالك بالإنترنت",
      "35": "أنت غير متصل بالإنترنت الآن.",
      "36": "حاول مرة أخرى",

      "37": "حدث خطأ. يُرجى المحاولة لاحقًا",
      "38": "خطأ في كلمة السر او البريد الالكتروني",
      "39": "لم يتم التحقق من عنوان البريد الإلكتروني",
      "40": "تم بنجاح",
      "41": "فشل إعادة تعيين كلمة المرور",


      "42": "فشل إعادة الإرسال",
      "43": "فشل التحقق",
      "44": "فشل في التحقق من البريد الإلكتروني",
      "45": "فشل التحقق من البريد الإلكتروني",
      "46": "أدخل رمز التحقق المرسل إلى رقم هاتفك",
      "47": "البحث",
      "0": "",
    },


    "en": {
      "1": "Create Account",
      "2": "Login",
      "3": "FullName",
      "4": "Email",
      "5": "Password",
      "6": "Phone",
      "7": "Already have an account ?sign in",
      "8": "Forgot your password?",
      "9": "Please enter your email",
      "10": "Send",
      "11": "Enter the verification code sent to your email address",
      "12": "Verification code",
      "13": "Verify",
      "14": "Verifying...",
      "15": "Resend Code",
      "16": "Reset Password",
      "17": "Please enter your new Password",
      "18": "New Password",
      "19": "Please enter the verification code",
      "20": "Verification code has been resent to your email",



      "21":  "Please enter your name",
      "22":  "Please enter your email",
      "23":  "Please enter a valid email address",
      "24":  "Please enter your password",
      "25":  "Please enter your phone number",
      "26":  "Password must be at least 8 characters",
      "27":  "Too many login attempts. Please try again later",
      "28":  "The code must contain only digits",
      "29":  "Email was not provided",
      "30": "Arabic",
      "31": "English",
      "32": "کوردی",


      "33": "No Internet",
      "34": "Please check your internet Connection,",
      "35": "you are in offline now.",
      "36": "Try again",

      "37": "An error occurred. Please try again later",
      "38": "Incorrect password or email address",
      "39": "The email address has not been verified",
      "40": "Successful",
      "41": "Failed to reset password",
      "42": "Resend failed",
      "43": "Verification failed",


        "44": "Failed to check email",
        "45": "Check email failed",
      "46": "Enter the verification code sent to your Phone",
      "47": "Search",

      "0": "",
    },




    "ku": {
  "1": "دروستکردنی ئەکاونت",
  "2": "چوونە ژوورەوە",
  "3": "ناوی تەواو",
  "4": "ئیمەیڵ",
  "5": "وشەی نهێنی",
  "6": "تەلەفۆن",
  "7": "پێشتر ئەکاونتێکتان هەیە ? چوونەژوورەوە",
  "8": "وشەی نهێنی لەبیرت چوو؟",
  "9": "تکایە ئیمەیڵەکەت بنووسە",
  "10": "ناردن",
  "11": "کۆدی پشتڕاستکردنەوە داخڵ بکە کە بۆ ناونیشانی ئیمەیڵەکەت نێردراوە",
  "12": "کۆدی پشتڕاستکردنەوە",
  "13": "دڵنیابوونەوە",
  "14": "دڵنیاکردنەوە...",
  "15": "کۆدی دووبارە ناردنەوە",
  "16": "وشەی نهێنی ڕێست بکەرەوە",
  "17": "وشەی نهێنی نوێت داخڵ بکە",
  "18": "وشەی نهێنی نوێ",
  "19": "تکایە کۆدی پشتڕاستکردنەوە داخڵ بکە",
  "20": "کۆدی پشتڕاستکردنەوە نێردراوەتەوە بۆ ئیمەیڵەکەت",
  "21": "تکایە ناوەکەت بنووسە",
  "22": "تکایە ناونیشانی ئیمەیڵەکەت بنووسە",
  "23": "تکایە ناونیشانی ئیمەیڵێکی دروست دابنێ",
  "24": "تکایە وشەی نهێنی خۆت بنووسە",
  "25": "تکایە ژمارەی تەلەفۆنەکەت بنووسە",
  "26": "پێویستە وشەی نهێنی لانیکەم ٨ پیت بێت",
  "27": "زۆر هەوڵی چوونەژوورەوە. تکایە دواتر هەوڵبدەرەوە",
  "28": "کۆدەکە دەبێت تەنها ژمارەکانی تێدابێت",
  "29": "ناونیشانی ئیمەیڵ داخڵ نەکراوە",
  "30": "عربي",
  "31": "انکليزي",
  "32": "کوردی",

  "33": "ئینتەرنێت نییە",
  "34": "تکایە پەیوەندی ئینتەرنێتەکەت بپشکنە،",
  "35": "ئێستا لە ئۆفلاین.",
  "36": "دووبارە هەوڵبدەرەوە",

  "37": "هەڵەیەک ڕوویدا. تکایە دواتر هەوڵبدەرەوە.",
  "38": "هەڵەی وشەی نهێنی یان ئیمەیڵ",
  "39": "ناونیشانی ئیمەیڵ نەک پشتڕاستکردنەوە",
  "40": "سەرکەوتوو",
  "41": "شکستی هێنا لە ڕێستکردنی وشەی نهێنی",


  "42": "دووبارە ناردن شکستی هێنا",
  "43": "پشتڕاستکردنەوە شکستی هێنا",
  "44": "شکستی هێنا لە پشکنینی ئیمەیڵ",
  "45": "پشکنینی ئیمەیڵ شکستی هێنا",
  "0": "",
    }

  };
}
